In [1]:
# Imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.formula.api as smf

In [2]:
data = pd.read_csv('data/usa_00049.csv')

In [ ]:
data.sample(1_000_000).to_csv('data/usa_00049_sample.csv')
data = data[data['INCTOT'] < 9999999]
data = data[data['INCTOT'] > 0]
data['logINCTOT'] = np.log(data['INCTOT'])

In [4]:
data.head()

,YEAR,SAMPLE,SERIAL,CBSERIAL,HHWT,CLUSTER,STRATA,GQ,PERNUM,PERWT,SEX,AGE,RACE,RACED,EDUC,EDUCD,INCTOT
0,2001,200101,1,NaN,186.0,2001000000011,1,1,1,179.0,1,39,1,100,3,30,6400
1,2001,200101,2,NaN,265.0,2001000000021,1,1,1,255.0,1,33,2,200,10,101,30000
2,2001,200101,3,NaN,652.0,2001000000031,1,1,1,690.0,2,40,1,100,6,62,16500
3,2001,200101,3,NaN,652.0,2001000000031,1,1,2,937.0,1,10,1,100,1,10,9999999
4,2001,200101,3,NaN,652.0,2001000000031,1,1,3,984.0,2,21,1,100,3,30,0

In [3]:
data = pd.read_csv('https://tayweid.github.io/econ-0150/projects/hamsa_bandi/data/usa_00049_sample.csv')